/*
* ChildrenData
*
* List all the features
*/
import React from 'react';
import { browserHistory } from 'react-router';
import HeaderSite from 'components/HeaderSite';
import SearchBar from 'components/SearchBar';
import { Field, reduxForm } from 'redux-form';
import { connect } from 'react-redux';



import { detectmob } from 'utils/functions';
import Helmet from 'react-helmet';


const styles = require('./Terms.scss');
export default class Terms extends React.Component {
    constructor(props) {
        super(props);
    }
    render() {
        return (
        <div className='terms'>
        <Helmet
        title="Terms Page"
        meta={[
            { name: 'description', content: 'Terms of 402' },
            ]}
            />
            <HeaderSite />
            <div className="wrapper-autocomplete">
            <SearchBar
            onNewRequest={this.props.handleNewRequest}
            handleSearchBtn={this.props.handleSearchBtn}
            data={this.props.searchBarData}
            />
            </div>
            <div className="hdr">
            <div className="title">תנאי השימוש באתר</div>
            <div></div>
            <div className="text">מציעה את המידע בשירות מקוון זה ברשת האינטרנט בכפוף לתנאים הבאים</div>
            </div>
            <div className="content-terms">
            <div className="wrap-term">
            <div className="text">המדריך החרדי בע"מ (להלן: "המדריך") הינה חברה בעלת אתר אינטרנט, אפליקציה ומדריך טלפוני (להלן "האתר") המתנה את קבלת האינפורמציה על ידה בתנאים שונים המפורטים בהסכם זה.</div>
<div className="text">האמור בהסכם זה מנוסח בלשון זכר לשם הנוחיות בלבד ואולם האמור בלשון זכר -  אף לשון נקבה במשמע, המונח "מתקשר" או "פונה" מתייחס לכל אדם ו/או גוף הנכנס לאתר המדריך ו/או לאפליקציה ו/או למדריך הנייר ו/או משתמש בכל מידע הניתן ע"י המדריך בכל אופן מכל סוג שהוא.
   </div>
   <div className="text">השימוש באתר מהווה הסכמה לאמור בהסכם זה באופן מלא ואם אינך מסכים לאמור בהסכם זה אינך רשאי לעשות שימוש באתר.
</div>
<div className="text">השירות המוענק על ידי חברת המדריך החרדי במסגרת האתר מספק למשתמשים פרטיים מדריך טלפונים וכן מספק האתר אפשרויות שונות לחיפוש עסקים, המדריך איננו מתחייב ליתן אינפורמציה מלאה על כל מנוי טלפוני ו/או אדם פרטי ו/או עסק, והמידע המופץ ו/או הנאסף ע"י המדריך נעשה לפי שיקול דעתו הבלעדי של המדריך.
</div>
<div className="text">הפרסום של לקוחות המדריך ו/או כל גוף אחר הינו באחריות הגוף המפרסם והמדריך איננו מתחייב כי הפרסום הוא נכון ו/או ממצה, על המשתמש לבחון ולבדוק את המצג של המפרסם על אחריות המשתמש בלבד.
</div>

<div className="text">המדריך איננו אחראי על כל מידע ו/או תגובה ו/או נתונים שניתנו לו ע"י המפרסמים ו/או משתמשים ו/או ע"י צדדים שלישיים הקשורים באתר ו/או נאספו על ידו והאחריות היא של המפרסם בלבד.
</div>

<div className="text">המדריך רשאי אך לא חייב לפרסם ו/או שלא לפרסם את המידע המתקבל מאת המשתמש וזאת על בסיס שיקול דעת המדריך בלבד.
</div>

<div className="text">המדריך רשאי לעשות שימוש בכל מידע המגיע אליו מהמשתמש, שם כתובת, מספר טלפון, כתובת מייל של המשתמש ו/או כל מידע שיש למשתמש ובין הייתר אנשי הקשר של המתקשר, כמו כן יהיה רשאי המדריך לשתף כל מידע מכל סוג שיש בידו עם חברות אחרות הקשורות למדריך ו/או חברות שאינם קשורות למדריך ו/או צ"ג כל שהוא ע"פ שיקול דעת המדריך בלבד, בין הייתר יהיה רשאי המדריך למסור באופן אקטיבי מידע למשתמש בטלפון באינטרנט ו/או בדואר וכן למסור למשתמש תוכן פרסומי בכל אופן שהוא, טלפוני, מייל, דואר ו/או כל דרך אחרת, וכניסת המשתמש לאתר ו/או הפעולה של המשתמש באתר ו/או העברת הנתונים למדריך ע"י המשתמש משמעה הסכמה לקבלת הפרסומות ו/או התכנים. מובהר כי המידע המגיע מהמשתמש הוא בין הייתר מידע שהמדריך יכול לאסוף אותו באמצעים דיגיטאלים ו/או בכל אופן אחר ו/או מידע המשתמש מוסר למדריך ו/או מאפשר גישה לקבציו של המתקשר (לרבות מספרי הטלפון השמורים של המשתמש) וכן מידע שניתן לאסוף אותו ללא קבלת רשות מהמשתמש (כגון ובין הייתר קבלת הנתונים בגין מס' הטלפון ממנו התבצעה השיחה ופניה למתקשר בחוזר כאמור) כל פרט אחר שניתן לקבלו באופן זה ו/או בכל אופן אחר.
</div>

<div className="text">חלק מהמספרים של המפרסמים באתר הם מספרים וירטואלים שניתנו להם ע"י המדריך ו/או מי מטעמו והחיוג למספר הוירטואלי מבצע בין הייתר העברת השיחה למספר הטלפון הישיר של המפרסם, המדריך רשאי להשתמש בכל אינפורמציה שניתנת לקבלה באופן זה כגון, מס' הטלפון של הפונה ו/או המתקשר ו/או כל נתון אחר שניתן לדלות אותו באופן זה, כמו כן יהיה רשאי המדריך לבצע הקלטה של השיחה, קבלה ואיסוף של נתוני השיחה מכל סוג וכן יהיה רשאי המדריך לקבל לידיו את נתוני מספר הטלפון של המחייג בין הייתר לצורך משלוח חומר פרסומי למחייג ו/או לכל צ"ג אחר הקשור בו.
</div>
<div className="text">למדריך הזכות להעדיף ו/או לגרוע ו/או חשיפה של מפרסמים בתחומים שונים בתחומים קשורים או לא קשורים לעסק שהמשתמש מעוניין לחפש וכן למדריך הזכות שלא לפרסם פרסומים שונים ו/או להגביל פרסומים שונים ו/או מידע לפי שיקול דעת המדריך בלבד.
</div>
<div className="text">ידוע למשתמש כי כניסה לאתר משאירה חותם אלקטרוני אשר המדריך יכול לעשות בו שימוש כל שהוא ובין הייתר לצורך זיהוי המשתמש באופן מהיר יותר.
</div>

<div className="text">המדריך איננו אחראי על פרסום המוגן בזכויות יוצרים והאחריות היא של המפרסם בלבד.
</div>


<div className="text">אין להשתמש במידע או בנתונים שניתנים ע"י המדריך שימוש עסקי או מסחרי כל שהוא לרבות יצירת מאגר מידע מכל סוג שהוא ו/או שאיבת מידע ו/או העתקה ו/או שימוש בכל מידע אחר ישיר או עקיף שניתן לדלות מהאתר.
</div>
<div className="text">אין לעשות שימוש כל שהוא באתר באמצעות מנוע חיפוש או כל אמצעי אלקטרוני מלבד שיטוט ידני וקבלת אינפורמציה המותרת ע"פ הסכם זה.
</div>

<div className="text">אין לכתוב ו/או להגיב באתר דברים שיש בהם לשון הרע ו/או דברים אסורים ע"פ כל דין.
</div>

<div className="text">אין למסור מידע, טקסט, תמונה ו/או כל חומר ו/או נתונים מכל סוג שהוא שיש בהם הפרה של זכויות יוצרים ו/או הם אסורים או מוגבלים לפרסום ע"פ דין.
</div>

<div className="text">אין לעשות שימוש בנתונים ו/או בתכנים ו/או תמונות ו/או בכל מידע אחר שיש באתר גם אם המידע הוא של המפרסמים ומובהר כי כל שימוש בתכנים אלו מוגן בין הייתר בזכויות יוצרים.
</div>
</div>
   </div>
       </div>   
            );
        }
    }

    